---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsEndConnectionType
source: html/ee49018e-53f1-4b3d-c760-8e7f07c4e6f5.htm
---
# Autodesk.Revit.DB.Architecture.StairsEndConnectionType

The join style between a run and landing.

## Syntax (C#)
```csharp
public enum StairsEndConnectionType
```